RT-Thread/rt-thread/bsp/nxp/mcx/mcxc/Libraries/MCXC444/MCXC444/drivers/fsl_slcd.h
/*! @brief SLCD blink rate. */
typedef enum _slcd_blink_rate
{
    kSLCD_BlinkRate00 = 0U, /*!< SLCD blink rate is LCD clock/((2^12)). */
    kSLCD_BlinkRate01,      /*!< SLCD blink rate is LCD clock/((2^13)). */
    kSLCD_BlinkRate02,      /*!< SLCD blink rate is LCD clock/((2^14)). */
    kSLCD_BlinkRate03,      /*!< SLCD blink rate is LCD clock/((2^15)). */
    kSLCD_BlinkRate04,      /*!< SLCD blink rate is LCD clock/((2^16)). */
    kSLCD_BlinkRate05,      /*!< SLCD blink rate is LCD clock/((2^17)). */
    kSLCD_BlinkRate06,      /*!< SLCD blink rate is LCD clock/((2^18)). */
    kSLCD_BlinkRate07       /*!< SLCD blink rate is LCD clock/((2^19)). */
} slcd_blink_rate_t;

/*! @brief SLCD fault detect clock prescaler. */
typedef enum _slcd_fault_detect_clock_prescaler
{
    kSLCD_FaultSampleFreqDivider1 = 0U, /*!< Fault detect sample clock frequency is 1/1 bus clock. */
    kSLCD_FaultSampleFreqDivider2,      /*!< Fault detect sample clock frequency is 1/2 bus clock. */
    kSLCD_FaultSampleFreqDivider4,      /*!< Fault detect sample clock frequency is 1/4 bus clock. */
    kSLCD_FaultSampleFreqDivider8,      /*!< Fault detect sample clock frequency is 1/8 bus clock. */
    kSLCD_FaultSampleFreqDivider16,     /*!< Fault detect sample clock frequency is 1/16 bus clock. */
    kSLCD_FaultSampleFreqDivider32,     /*!< Fault detect sample clock frequency is 1/32 bus clock. */
    kSLCD_FaultSampleFreqDivider64,     /*!< Fault detect sample clock frequency is 1/64 bus clock. */
    kSLCD_FaultSampleFreqDivider128     /*!< Fault detect sample clock frequency is 1/128 bus clock. */
} slcd_fault_detect_clock_prescaler_t;

/*! @brief SLCD fault detect sample window width. */
typedef enum _slcd_fault_detect_sample_window_width
{
    kSLCD_FaultDetectWindowWidth4SampleClk = 0U, /*!< Sample window width is 4 sample clock cycles. */
    kSLCD_FaultDetectWindowWidth8SampleClk,      /*!< Sample window width is 8 sample clock cycles. */
    kSLCD_FaultDetectWindowWidth16SampleClk,     /*!< Sample window width is 16 sample clock cycles. */
    kSLCD_FaultDetectWindowWidth32SampleClk,     /*!< Sample window width is 32 sample clock cycles. */
    kSLCD_FaultDetectWindowWidth64SampleClk,     /*!< Sample window width is 64 sample clock cycles. */
    kSLCD_FaultDetectWindowWidth128SampleClk,    /*!< Sample window width is 128 sample clock cycles. */
    kSLCD_FaultDetectWindowWidth256SampleClk,    /*!< Sample window width is 256 sample clock cycles. */
    kSLCD_FaultDetectWindowWidth512SampleClk     /*!< Sample window width is 512 sample clock cycles. */
} slcd_fault_detect_sample_window_width_t;

/*! @brief SLCD interrupt source. */
typedef enum _slcd_interrupt_enable
{
    kSLCD_FaultDetectCompleteInterrupt = 1U, /*!< SLCD fault detection complete interrupt source. */
#if FSL_FEATURE_SLCD_HAS_FRAME_FREQUENCY_INTERRUPT
    kSLCD_FrameFreqInterrupt = 2U /*!< SLCD frame frequency interrupt source. Not available in all low-power modes. */
#endif                            /* FSL_FEATURE_SLCD_HAS_FRAME_FREQUENCY_INTERRUPT */
} slcd_interrupt_enable_t;

/*! @brief SLCD behavior in low power mode. */
typedef enum _slcd_lowpower_behavior
{
    kSLCD_EnabledInWaitStop = 0, /*!< SLCD works in wait and stop mode. */
    kSLCD_EnabledInWaitOnly,     /*!< SLCD works in wait mode and is disabled in stop mode. */
    kSLCD_EnabledInStopOnly,     /*!< SLCD works in stop mode and is disabled in wait mode. */
    kSLCD_DisabledInWaitStop     /*!< SLCD is disabled in stop mode and wait mode. */
} slcd_lowpower_behavior;

/*! @brief SLCD fault frame detection configuration structure. */
typedef struct _slcd_fault_detect_config
{
    bool faultDetectIntEnable;       /*!< Fault frame detection interrupt enable flag.*/
    bool faultDetectBackPlaneEnable; /*!< True means the pin id fault detected is back plane otherwise front plane. */
    uint8_t faultDetectPinIndex;     /*!< Fault detected pin id  from 0 to 63. */
    slcd_fault_detect_clock_prescaler_t faultPrescaler; /*!< Fault detect clock prescaler. */
    slcd_fault_detect_sample_window_width_t width;      /*!< Fault detect sample window width. */
} slcd_fault_detect_config_t;

/*! @brief SLCD clock configuration structure. */
typedef struct _slcd_clock_config
{
    slcd_clock_src_t clkSource; /*!< Clock source. "slcd_clock_src_t" is recommended to be used.
                                  The SLCD is optimized to operate using a 32.768kHz clock input. */
    slcd_alt_clock_div_t
        altClkDivider; /*!< The divider to divide the alternate clock used for alternate clock source. */
    slcd_clock_prescaler_t clkPrescaler; /*!< Clock prescaler. */
#if FSL_FEATURE_SLCD_HAS_FAST_FRAME_RATE
    bool fastFrameRateEnable; /*!< Fast frame rate enable flag. */
#endif                        /* FSL_FEATURE_SLCD_HAS_FAST_FRAME_RATE */
} slcd_clock_config_t;

/*! @brief SLCD configuration structure. */
typedef struct _slcd_config
{
    slcd_power_supply_option_t powerSupply;    /*!< Power supply option. */
    slcd_regulated_voltage_trim_t voltageTrim; /*!< Regulated voltage trim used for the internal regulator VIREG to
                                                  adjust to facilitate contrast control. */
    slcd_clock_config_t *clkConfig;            /*!< Clock configure. */
    slcd_display_mode_t displayMode;           /*!< SLCD display mode. */
    slcd_load_adjust_t loadAdjust;             /*!< Load adjust to handle glass capacitance. */
    slcd_duty_cycle_t dutyCycle;               /*!< Duty cycle. */
    slcd_lowpower_behavior lowPowerBehavior;   /*!< SLCD behavior in low power mode. */
#if FSL_FEATURE_SLCD_HAS_FRAME_FREQUENCY_INTERRUPT
    bool frameFreqIntEnable;    /*!< Frame frequency interrupt enable flag.*/
#endif                          /* FSL_FEATURE_SLCD_HAS_FAST_FRAME_RATE */
    uint32_t slcdLowPinEnabled; /*!< Setting enabled SLCD pin 0 ~ pin 31. Setting bit n to 1 means enable pin n. */
    uint32_t
        slcdHighPinEnabled; /*!< Setting enabled SLCD pin 32 ~ pin 63. Setting bit n to 1 means enable pin (n + 32). */
    uint32_t backPlaneLowPin;  /*!< Setting back plane pin 0 ~ pin 31. Setting bit n to 1 means setting pin n as back
                                  plane. It should never have the same bit setting as the frontPlane Pin. */
    uint32_t backPlaneHighPin; /*!< Setting back plane pin 32 ~ pin 63. Setting bit n to 1 means setting pin (n + 32) as
                                  back plane. It should never have the same bit setting as the frontPlane Pin. */
    slcd_fault_detect_config_t *faultConfig; /*!< Fault frame detection configure. If not requirement, set to NULL. */
} slcd_config_t;
